Repository: r-devel/rpart
Catalog: po/R-*.po
Languages: es

source: 'x' must be a numeric vector
es: 'x' debe ser un vector numérico

source: Not a legitimate "rpart" object
es: No es un objeto "rpart" legítimo

source: Plot not useful for classification or poisson trees
es: Gráfico no útil para clasificación o árboles de Poisson

source: fit is not a tree, just a root
es: fit no es un árbol, sólo una raíz

source: 'cptable' does not contain cross-validation results
es: 'cptable' no contiene resultados de validación cruzada

source: Tree has variables not found in new data
es: El árbol tiene variables que no se encuentran en los datos nuevos

source: type 'class' is only appropriate for classification
es: el tipo 'class' sólo es apropiado para la clasificación

source: Invalid prediction for "rpart" object
es: Predicción no válida para el objeto "rpart"

source: 'x' must be an "rpart" object
es: 'x' debe ser un objeto "rpart"

source: Invalid type of residual
es: Tipo de residual no válido

source: Not legitimate "rpart" tree and endpoint not a 2 level-factor
es: El árbol "rpart" no es legítimo y el extremo final no es un factor de 2 niveles

source: a 'formula' argument is required
es: se requiere un argumento 'formula'

source: Trees cannot handle interaction terms
es: Los árboles no pueden manejar términos de interacción

source: negative weights not allowed
es: pesos negativos no permitidos

source: Invalid method
es: Método no válido

source: Argument %s not matched
es: Argumento %s no coincidente

source: Wrong length for 'xval'
es: Longitud incorrecta para 'xval'

source: Cost vector is the wrong length
es: El vector de costos tiene una longitud incorrecta

source: Cost vector must be positive
es: El vector de costos debe ser positivo

source: Initialization routine is missing the 'summary' function
es: A la rutina de inicialización le falta la función 'summary'

source: no information available on parameters from previous call to plot()
es: no hay información disponible sobre los parámetros de la llamada anterior a plot()

source: No offset allowed in classification models
es: No se permite compensación en los modelos de clasificación.

source: The parms list must have names
es: La lista de parámetros debe tener nombres.

source: 'parms' component not matched: %s
es: componente 'parms' no coincide: %s

source: Priors must sum to 1
es: Las probabilidades a priori (priors) deben sumar 1

source: Priors must be >= 0
es: Las probabilidades a priori (priors) deben ser >= 0

source: Wrong length for priors
es: Longitud incorrecta para probabilidades a priori (priors)

source: Wrong length for loss matrix
es: Longitud incorrecta para la matriz de pérdida

source: Loss matrix must have zero on diagonals
es: La matriz de pérdida debe tener cero en las diagonales

source: Loss matrix cannot have negative elements
es: La matriz de pérdida no puede tener elementos negativos

source: Loss matrix has a row of zeros
es: La matriz de pérdida tiene una fila de ceros

source: Invalid splitting rule
es: Regla de subdivisión no válida

source: Parameter argument must be a list
es: El argumento del parámetro debe ser una lista

source: The value of 'maxcompete' supplied is < 0; the value 0 was used instead
es: El valor de 'maxcompete' suministrado es < 0; en su lugar se utilizó el valor 0

source: The value of 'xval' supplied is < 0; the value 0 was used instead
es: El valor de 'xval' suministrado es < 0; en su lugar se utilizó el valor 0

source: Maximum depth is 30
es: La profundidad máxima es 30

source: Maximum depth must be at least 1
es: La profundidad máxima debe ser de al menos 1

source: The value of 'usesurrogate' supplied was out of range, the default value of 2 is used instead.
es: El valor de 'usesurrogate' proporcionado estaba fuera de rango; en su lugar se utiliza el valor predeterminado de 2.

source: The value of 'surrogatestyle' supplied was out of range, the default value of 0 is used instead.
es: El valor de 'surrogatestyle' proporcionado estaba fuera de rango; en su lugar se utiliza el valor predeterminado de 0.

source: Response must be a 'survival' object - use the 'Surv()' function
es: La respuesta debe ser un objeto 'survival' - use la función 'Surv()'

source: Observation time must be > 0
es: El tiempo de observación debe ser > 0

source: No deaths in data set
es: No hay muertes en el conjunto de datos

source: You must input a named list for parms
es: Debe ingresar una lista con nombre para los parámetros

source: Invalid error method for Poisson
es: Método de error no válido para Poisson

source: Invalid shrinkage value
es: Valor de contracción no válido

source: response must be a 2 column matrix or a vector
es: la respuesta debe ser una matriz de 2 columnas o un vector

source: Number of events must be >= 0
es: El número de eventos debe ser >= 0

source: User written methods must have 3 functions
es: Los métodos escritos por el usuario deben tener 3 funciones

source: User written method does not contain an 'init' function
es: El método escrito por el usuario no contiene una función 'init'

source: User written method does not contain a 'split' function
es: El método escrito por el usuario no contiene una función 'split'

source: User written method does not contain an 'eval' function
es: El método escrito por el usuario no contiene una función 'eval'

source: User 'eval' function returned invalid label
es: La función del usuario 'eval' devolvió una etiqueta no válida

source: User 'eval' function returned invalid deviance
es: La función del usuario 'eval' devolvió una desviación no válida

source: Invalid return from categorical 'split' function
es: Devolución no válida de la función categórica 'split'

source: User 'split' function returned invalid goodness
es: La función del usuario 'split' devolvió una bondad (goodness) no válida

source: User 'split' function returned invalid direction
es: La función del usuario 'split' devolvió una dirección no válida

source: may not be applicable for this method
es: puede no ser aplicable para este método

source: Not an "rpart" object
es: No es un objeto "rpart"

source: Nodes %s are not in this tree
es: Los nodos %s no están en este árbol

source: argument 'label' is no longer used
es: el argumento 'label' ya no se utiliza

source: Invalid fit object
es: Objeto de ajuste no válido

source: supplied nodes %s are not in this tree
es: los nodos proporcionados %s no están en este árbol

source: supplied nodes %s are leaves
es: los nodos suministrados %s son hojas
